{"config": [{"config": {"batch_input_shape": [null, 3, 32, 30], "border_mode": "same", "activation": "linear", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_filter": 32, "nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_1", "activity_regularizer": null, "input_dtype": "float32", "dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "nb_filter": 32, "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_col": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"border_mode": "same", "activation": "linear", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_col": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_col": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "b_regularizer": null, "output_dim": 512, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "linear", "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "b_regularizer": null, "output_dim": 34, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}